#### Write a python program to remove duplicates from Dict

In [7]:
std_data = { 'id1':
           {'name':['Sachin'],
           'class':['V'],
           'subject_integration':['English','Maths','Science']
           },
           'id2':
           {'name':['David'],
            'class': ['V'],
            'subject_integration': ['English','Maths','Science']
           },
           'id3':
           {'name': ['Sachin'],
           'class': ['V'],
           'subject_integration': ['English','Maths','Science']
           },
           'id4':
           {'name': ['Surya'],
            'class': ['V'],
            'subject_integration': ['English','Maths','Science']
           },
           }
result={}
for key,value in std_data.items():
    if value not in result.values():
        result[key]=value
print(result)

{'id1': {'name': ['Sachin'], 'class': ['V'], 'subject_integration': ['English', 'Maths', 'Science']}, 'id2': {'name': ['David'], 'class': ['V'], 'subject_integration': ['English', 'Maths', 'Science']}, 'id4': {'name': ['Surya'], 'class': ['V'], 'subject_integration': ['English', 'Maths', 'Science']}}

In [11]:
pd.DataFrame(std_data)

,id1,id2,id3,id4
name,[Sachin],[David],[Sachin],[Surya]
class,[V],[V],[V],[V]
subject_integration,"[English, Maths, Science]","[English, Maths, Science]","[English, Maths, Science]","[English, Maths, Science]"

In [10]:
import pandas as pd
pd.DataFrame(result)

,id1,id2,id4
name,[Sachin],[David],[Surya]
class,[V],[V],[V]
subject_integration,"[English, Maths, Science]","[English, Maths, Science]","[English, Maths, Science]"